PlannerApp.factory('scientificWorkFormFieldFactory', function () {
	var ScientificWorkFormFields = {
		"ImplementationPlannedResearchManager": {
			name: "Виконання планових наукових досліджень керівнику (годин на 1 ум.-друк. арк. на рік)",
			alt: "Виконання планових наукових досліджень керівнику (годин на 1 ум.-друк. арк. на рік)"
		},
		"ImplementationPlannedResearchPerformer": {
			name: "Виконання планових наукових досліджень виконавцю (годин на 1 ум.-друк. арк. на рік)",
			alt: "Виконання планових наукових досліджень виконавцю (годин на 1 ум.-друк. арк. на рік)"
		},
		"DevelopmentInnovativeResearchProjectsManager": {
			name: "Розробка інноваційно-дослідницьких проектів керівнику(годин на 1 ум.-друк. арк. на рік)",
			alt: "Розробка інноваційно-дослідницьких проектів керівнику(годин на 1 ум.-друк. арк. на рік)"
		},
		"DevelopmentInnovativeResearchProjectsManagerPerformer": {
			name: "Розробка інноваційно-дослідницьких проектів виконавцю (годин на 1 ум.-друк. арк. на рік)",
			alt: "Розробка інноваційно-дослідницьких проектів виконавцю (годин на 1 ум.-друк. арк. на рік)"
		},
		"InventiveJobTeachingInternationalPatents": {
			name: "Винахідницька робота викладача міжнародні  патенти (годин на 1 об’єкт)",
			alt: "Винахідницька робота викладача міжнародні  патенти (годин на 1 об’єкт)"
		},
		"InventiveWorkTeachersPatents": {
			name: "Винахідницька робота викладача патенти (годин на 1 об’єкт)",
			alt: "Винахідницька робота викладача патенти (годин на 1 об’єкт)"
		},
		"InventiveWorkTeacherPatentUtilityModel": {
			name: "Винахідницька робота викладача патенти на корисну модель (годин на 1 об’єкт)",
			alt: "Винахідницька робота викладача патенти на корисну модель (годин на 1 об’єкт)"
		},
		"InventiveJobTeachingCertificateWork": {
			name: "Винахідницька робота викладача свідоцтва на твір (годин на 1 об’єкт)",
			alt: "Винахідницька робота викладача свідоцтва на твір (годин на 1 об’єкт)"
		},
		"CollectiveMonographPublishedInDomesticPublishing": {
			name: "Колективна монографія  опублікована у вітчизняних видавництвах (годин на 1 ум. друк. арк)",
			alt: "Колективна монографія  опублікована у вітчизняних видавництвах (годин на 1 ум. друк. арк)"
		},
		"SoleMonographPublishedInDomesticPublishing": {
			name: "Однооосібна монографія опублікована у вітчизняних видавництвах  (годин на 1 ум. друк. арк)",
			alt: "Однооосібна монографія опублікована у вітчизняних видавництвах  (годин на 1 ум. друк. арк)"
		},
		"CollectiveMonographPublishedInForeignPublishingHouses": {
			name: "Колективна монографія опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)",
			alt: "Колективна монографія опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)"
		},
		"SoleMonographPublishedInForeignPublishingHouses": {
			name: "Однооосібна монографія опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)",
			alt: "Однооосібна монографія опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)"
		},
		"PublicationScientificArticlesInJournals": {
			name: "Публікація наукових статей у журналах що індексуються в міжнародних науко-метричних базах Scopus, Web of Science та мають імпакт-фактор, більший від 1 (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей у журналах що індексуються в міжнародних науко-метричних базах Scopus, Web of Science та мають імпакт-фактор, більший від 1 (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificArticlesAcademicEditions": {
			name: "Публікація наукових статей у наукових виданнях, що індексуються в інших міжнародних наукометричних базах (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей у наукових виданнях, що індексуються в інших міжнародних наукометричних базах (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificPapersInInternationalJournals": {
			name: "Публікація наукових статей у зарубіжних журналах (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей у зарубіжних журналах (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificPapersProfessionalNationaJournals": {
			name: "Публікація наукових статей у фахових вітчизняних виданнях (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей у фахових вітчизняних виданнях (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificPapersNationaJournals": {
			name: "Публікація наукових статей у вітчизняних виданнях (що не входять до наукометричних баз даних) (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей у вітчизняних виданнях (що не входять до наукометричних баз даних) (годин на 1 ум.-друк. арк.)"
		},
		"PublicationAbstractsForeignJournals": {
			name: "Публікація тез доповідей в зарубіжних виданнях (годин на 1 ум.-друк. арк.)",
			alt: "Публікація тез доповідей в зарубіжних виданнях (годин на 1 ум.-друк. арк.)"
		},
		"PublicationAbstractsConferencesSymposiaSeminars": {
			name: "Публікація тез доповідей на конференціях, симпозіумах, семінарах (міжнародних, вітчизняних та ін.) (годин на 1 ум.-друк. арк.)",
			alt: "Публікація тез доповідей на конференціях, симпозіумах, семінарах (міжнародних, вітчизняних та ін.) (годин на 1 ум.-друк. арк.)"
		},
		"CollectiveMonographForeignLanguagePublishedInDomesticPublishing": {
			name: "Колективна монографія  іноземною мовою опублікована у вітчизняних видавництвах (годин на 1 ум. друк. арк)",
			alt: "Колективна монографія  іноземною мовою опублікована у вітчизняних видавництвах (годин на 1 ум. друк. арк)"
		},
		"SoleForeignLanguageMonographPublishedInDomesticPublishing": {
			name: "Однооосібна монографія іноземною мовою опублікована у вітчизняних видавництвах  (годин на 1 ум. друк. арк)",
			alt: "Однооосібна монографія іноземною мовою опублікована у вітчизняних видавництвах  (годин на 1 ум. друк. арк)"
		},
		"CollectiveMonographPublishedForeignLanguageForeignPublishers": {
			name: "Колективна монографія іноземною мовою опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)",
			alt: "Колективна монографія іноземною мовою опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)"
		},
		"SoleForeignLanguageMonographPublishedInForeignPublishingHouses": {
			name: "Однооосібна монографія іноземною мовою опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)",
			alt: "Однооосібна монографія іноземною мовою опублікована у зарубіжних видавництвах  (годин на 1 ум. друк. арк)"
		},
		"PublicationScientificArticlesForeignLanguageJournalsScopusWeb": {
			name: "Публікація наукових статей іноземною мовою у журналах що індексуються в міжнародних науко-метричних базах Scopus, Web of Science та мають імпакт-фактор, більший від 1 (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей іноземною мовою у журналах що індексуються в міжнародних науко-метричних базах Scopus, Web of Science та мають імпакт-фактор, більший від 1 (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificArticlesForeignLanguageInScientificEditions": {
			name: "Публікація наукових статей іноземною мовою у наукових виданнях, що індексуються в інших міжнародних наукометричних базах (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей іноземною мовою у наукових виданнях, що індексуються в інших міжнародних наукометричних базах (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificPapersForeigLanguageInternationalJournals": {
			name: "Публікація наукових статей іноземною мовою у зарубіжних журналах (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей іноземною мовою у зарубіжних журналах (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificPapersForeignLanguageProfessionalNationaJournals": {
			name: "Публікація наукових статей іноземною мовою у фахових вітчизняних виданнях (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей іноземною мовою у фахових вітчизняних виданнях (годин на 1 ум.-друк. арк.)"
		},
		"PublicationScientificPapersForeignLanguageNationaJournals": {
			name: "Публікація наукових статей іноземною мовою у вітчизняних виданнях (що не входять до наукометричних баз даних) (годин на 1 ум.-друк. арк.)",
			alt: "Публікація наукових статей іноземною мовою у вітчизняних виданнях (що не входять до наукометричних баз даних) (годин на 1 ум.-друк. арк.)"
		},
		"PublicationAbstractsForeignLanguageForeignJournals": {
			name: "Публікація тез доповідей іноземною мовою в зарубіжних виданнях (годин на 1 ум.-друк. арк.)",
			alt: "Публікація тез доповідей іноземною мовою в зарубіжних виданнях (годин на 1 ум.-друк. арк.)"
		},
		"PublicationAbstractsForeignLanguageConferencesSymposiaSeminars": {
			name: "Публікація тез доповідей іноземною мовою на конференціях, симпозіумах, семінарах (міжнародних, вітчизняних та ін.) (годин на 1 ум.-друк. арк.)",
			alt: "Публікація тез доповідей іноземною мовою на конференціях, симпозіумах, семінарах (міжнародних, вітчизняних та ін.) (годин на 1 ум.-друк. арк.)"
		},
		"ProtectingThesisForDegreeDoctorOfScience": {
			name: "Захист дисертацій на здобуття ступеня доктора наук (для аспірантів та док­торантів, що навча­ються без відриву від виробництва) (годин)",
			alt: "Захист дисертацій на здобуття ступеня доктора наук (для аспірантів та док­торантів, що навча­ються без відриву від виробництва) (годин)"
		},
		"DefendingTthesisForPhD": {
			name: "Захист дисертацій на здобуття ступеня доктора філософії  (для аспірантів та док­торантів, що навча­ються без відриву від виробництва) (годин)",
			alt: "Захист дисертацій на здобуття ступеня доктора філософії  (для аспірантів та док­торантів, що навча­ються без відриву від виробництва) (годин)"
		},
		"TheCandidateExams": {
			name: "Складання кандидатських екзаменів (для аспірантів та док­торантів, що навча­ються без відриву від виробництва) (годин на іспит)",
			alt: "Складання кандидатських екзаменів (для аспірантів та док­торантів, що навча­ються без відриву від виробництва) (годин на іспит)"
		},
		"GuidStudentsInResearchWorkOnPreparationScientificArticles": {
			name: "Керівництво науковою роботою студентів з підготовки наукових статей (годин на 1 ум. друк. арк.)",
			alt: "Керівництво науковою роботою студентів з підготовки наукових статей (годин на 1 ум. друк. арк.)"
		},
		"GuidStudentsInResearchWorkOnPreparationAbstractsForConference": {
			name: "Керівництво науковою роботою студентів з підготовки тез доповідей на конференцію (годин на 1 ум. друк. арк.)",
			alt: "Керівництво науковою роботою студентів з підготовки тез доповідей на конференцію (годин на 1 ум. друк. арк.)"
		},
		"GuidStudentsInResearchWorkOnPreparationApplicationsForSecurityDocuments": {
			name: "Керівництво науковою роботою студентів з підготовки заявок на видачу охоронних документів (годин на 1 ум. друк. арк.)",
			alt: "Керівництво науковою роботою студентів з підготовки заявок на видачу охоронних документів (годин на 1 ум. друк. арк.)"
		},
		"StudentsWinnersParticipateInInternationalCompetitions": {
			name: "Підготовка студентів-переможців та призерів до участі в конкурсах міжнародного рівня (годин на 1 науко­ву роботу)",
			alt: "Підготовка студентів-переможців та призерів до участі в конкурсах міжнародного рівня (годин на 1 науко­ву роботу)"
		},
		"StudentsWinnersParticipateInUkrainianLevelPhase1": {
			name: "Підготовка студентів-переможців та призерів до участі в конкурсах всеукраїнського рівня (І етап)(годин на 1 науко­ву роботу)",
			alt: "Підготовка студентів-переможців та призерів до участі в конкурсах всеукраїнського рівня (І етап)(годин на 1 науко­ву роботу)"
		},
		"StudentsWinnersParticipateInUkrainianLevelPhase2": {
			name: "Підготовка студентів-переможців та призерів до участі в конкурсах всеукраїнського рівня (ІІ етап) (годин на 1 науко­ву роботу)",
			alt: "Підготовка студентів-переможців та призерів до участі в конкурсах всеукраїнського рівня (ІІ етап) (годин на 1 науко­ву роботу)"
		},
		"StudentsWinnersParticipateInRegionalLevel": {
			name: "Підготовка студентів-переможців та призерів до участі в конкурсах регіонального рівня (годин на 1 науко­ву роботу)",
			alt: "Підготовка студентів-переможців та призерів до участі в конкурсах регіонального рівня (годин на 1 науко­ву роботу)"
		},
		"StudentsWinnersParticipateInUniversityLevel": {
			name: "Підготовка студентів-переможців та призерів до участі в конкурсах університетського рівня (годин на 1 науко­ву роботу)",
			alt: "Підготовка студентів-переможців та призерів до участі в конкурсах університетського рівня (годин на 1 науко­ву роботу)"
		},
		"StudentsWinnersParticipateInInternationalOlympiad": {
			name: "Підготовка студентів-переможців та призерів до участі в олімпіаді міжнародного рівня (годин на 1 студента)",
			alt: ""
		},
		"StudentsWinnersParticipateInUkrainianLevelOlympiadPhase1": {
			name: "Підготовка студентів-переможців та призерів до участі в олімпіаді всеукраїнський рівень (І етап) (годин на 1 студента)",
			alt: "Підготовка студентів-переможців та призерів до участі в олімпіаді всеукраїнський рівень (І етап) (годин на 1 студента)"
		},
		"StudentsWinnersParticipateInUkrainianLevelOlympiadPhase2": {
			name: "Підготовка студентів-переможців та призерів до участі в олімпіаді всеукраїнського рівня (ІІ етап)(годин на 1 студента)",
			alt: "Підготовка студентів-переможців та призерів до участі в олімпіаді всеукраїнського рівня (ІІ етап)(годин на 1 студента)"
		},
		"StudentsWinnersParticipateInOlympiadRegionalLevel": {
			name: "Підготовка студентів-переможців та призерів до участі в олімпіаді регіонального рівня (годин на 1 студента)",
			alt: "Підготовка студентів-переможців та призерів до участі в олімпіаді регіонального рівня (годин на 1 студента)"
		},
		"StudentsWinnersParticipateInOlympiadUniversityLevel": {
			name: "Підготовка студентів-переможців та призерів до участі в олімпіаді університетського рівня (годин на 1 студента)",
			alt: "Підготовка студентів-переможців та призерів до участі в олімпіаді університетського рівня (годин на 1 студента)"
		},
		"ManagementStudentScienceClub": {
			name: "Керівництво студентським науковим гуртком, групою з науково-дослідної проблеми (годин на навчальний рік)",
			alt: "Керівництво студентським науковим гуртком, групою з науково-дослідної проблеми (годин на навчальний рік)"
		},
		"OrganizationAndHoldingInternationalEventsOrganizingCommitteeChairman": {
			name: "Організація та проведення міжнародних заходів голова оргкомітету (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)",
			alt: "Організація та проведення міжнародних заходів голова оргкомітету (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)"
		},
		"OrganizationAndHoldingInternationalEventsSecretary": {
			name: "Організація та проведення міжнародних заходів секретар, члени оргко¬мітету, керівники секцій (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)",
			alt: "Організація та проведення міжнародних заходів секретар, члени оргко¬мітету, керівники секцій (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)"
		},
		"OrganizationAndHoldingUkrainianEventsOrganizingCommitteeChairman": {
			name: "Організація та проведення всеукраїнських заходів голова оргкомітету (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)",
			alt: "Організація та проведення всеукраїнських заходів голова оргкомітету (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)"
		},
		"OrganizationAndHoldingUkrainianEventsSecretary": {
			name: "Організація та проведення всеукраїнських заходів секретар, члени оргкомітету, керівники секцій (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)",
			alt: "Організація та проведення всеукраїнських заходів секретар, члени оргкомітету, керівники секцій (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)"
		},
		"OrganizationInterUniversityInterfacultyInterdepartmentalActivitiesOrganizingCommitteeChairman": {
			name: "Організація та проведення міжуніверситетських, міжфакультетських, міжкафедральних заходів голова оргкомітету (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)",
			alt: "Організація та проведення міжуніверситетських, міжфакультетських, міжкафедральних заходів голова оргкомітету (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)"
		},
		"OrganizationInterUniversityInterfacultyInterdepartmentalActivitiesSecretary": {
			name: "Організація та проведення міжуніверситетських, міжфакультетських, міжкафедральних заходів секретар, члени оргкомітету, керівники секцій (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)",
			alt: "Організація та проведення міжуніверситетських, міжфакультетських, міжкафедральних заходів секретар, члени оргкомітету, керівники секцій (наукових конференцій, симпозіумів, семінарів для студентів, аспірантів та викладачів) (годин на 1 захід)"
		},
		"OrganizationAndHoldingInternationalEvents": {
			name: "Організація та проведення міжнародних заходів (телеконференцій, вебінарів) (годин на один захід)",
			alt: "Організація та проведення міжнародних заходів (телеконференцій, вебінарів) (годин на один захід)"
		},
		"OrganizationAndHoldingUkrainianEvents": {
			name: "Організація та проведення всеукраїнських заходів (телеконференцій, вебінарів) (годин на один захід)",
			alt: "Організація та проведення всеукраїнських заходів (телеконференцій, вебінарів) (годин на один захід)"
		},
		"ManagementStudentScienceSchool": {
			name: "Керівництво науковою школою (годин на навчальний рік)",
			alt: "Керівництво науковою школою (годин на навчальний рік)"
		},
		"ResponsiblForScientificWorkDepartment": {
			name: "Відповідальний за наукову роботу на кафедрі (годин на навчальний рік)",
			alt: "Відповідальний за наукову роботу на кафедрі (годин на навчальний рік)"
		},
		"ReviewingAbstractsForDegree": {
			name: "Рецензування авторефератів на здобуття ступеня доктора філософії, доктора наук, періодичних видань, монографій, підручників, навчальних посібників, наукових статей, студентських наукових робіт (годин на 1 ум. друк. арк. роботи)",
			alt: "Рецензування авторефератів на здобуття ступеня доктора філософії, доктора наук, періодичних видань, монографій, підручників, навчальних посібників, наукових статей, студентських наукових робіт (годин на 1 ум. друк. арк. роботи)"
		},
		"ReviewingForeignLanguagePublications": {
			name: "Рецензування видань іноземною мовою (окрім російської)",
			alt: "Рецензування видань іноземною мовою (окрім російської)"
		},
		"ChairmanEditorialBoardSscientificJournals": {
			name: "Голова редколегії наукових журналів, у редакційних радах збірників праць та ін. (години) ",
			alt: "Голова редколегії наукових журналів, у редакційних радах збірників праць та ін. (години) "
		},
		"DeputyChairmanEditorialBoardSscientificJournals": {
			name: "Заступник голови редколегії наукових журналів, у редакційних радах збірників праць та ін. (години) ",
			alt: "Заступник голови редколегії наукових журналів, у редакційних радах збірників праць та ін. (години) "
		},
		"MemberEditorialBoardSscientificJournals": {
			name: "Члени редколегії редколегії наукових журналів, у редакційних радах збірників праць та ін. (години) ",
			alt: "Члени редколегії редколегії наукових журналів, у редакційних радах збірників праць та ін. (години) "
		}
	};
	return ScientificWorkFormFields;

});